---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.IsWorkshared
source: html/7ba0cb4d-5498-567e-e523-5c9229303f9d.htm
---
# Autodesk.Revit.DB.BasicFileInfo.IsWorkshared Property

Checks if the file is workshared.

## Syntax (C#)
```csharp
public bool IsWorkshared { get; }
```